_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_75 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_117 (Activation)  (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_76 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_118 (Activation)  (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_38 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_59 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
flatten_22 (Flatten)         (None, 28704)             0         
_________________________________________________________________
dense_43 (Dense)             (None, 512)               14696960  
_________________________________________________________________
activation_119 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_60 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_44 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_120 (Activation)  (None, 3)                 0         
=================================================================
Total params: 14,708,643
Trainable params: 14,708,643
Non-trainable params: 0
_________________________________________________________________
