_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_91 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_149 (Activation)  (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_92 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_150 (Activation)  (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_46 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_75 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
flatten_30 (Flatten)         (None, 28704)             0         
_________________________________________________________________
dense_59 (Dense)             (None, 512)               14696960  
_________________________________________________________________
activation_151 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_76 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_60 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_152 (Activation)  (None, 3)                 0         
=================================================================
Total params: 14,708,643
Trainable params: 14,708,643
Non-trainable params: 0
_________________________________________________________________
