_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_37 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_55 (Activation)   (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_56 (Activation)   (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_28 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 23, 39, 64)        18496     
_________________________________________________________________
activation_57 (Activation)   (None, 23, 39, 64)        0         
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 21, 37, 64)        36928     
_________________________________________________________________
activation_58 (Activation)   (None, 21, 37, 64)        0         
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 10, 18, 64)        0         
_________________________________________________________________
dropout_29 (Dropout)         (None, 10, 18, 64)        0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 11520)             0         
_________________________________________________________________
dense_19 (Dense)             (None, 512)               5898752   
_________________________________________________________________
activation_59 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_30 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_20 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_60 (Activation)   (None, 3)                 0         
=================================================================
Total params: 5,965,859
Trainable params: 5,965,859
Non-trainable params: 0
_________________________________________________________________
