_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_89 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_145 (Activation)  (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_90 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_146 (Activation)  (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_45 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_73 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
flatten_29 (Flatten)         (None, 28704)             0         
_________________________________________________________________
dense_57 (Dense)             (None, 512)               14696960  
_________________________________________________________________
activation_147 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_74 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_58 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_148 (Activation)  (None, 3)                 0         
=================================================================
Total params: 14,708,643
Trainable params: 14,708,643
Non-trainable params: 0
_________________________________________________________________
