_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_69 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_105 (Activation)  (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_70 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_106 (Activation)  (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_35 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_53 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
flatten_19 (Flatten)         (None, 28704)             0         
_________________________________________________________________
dense_37 (Dense)             (None, 512)               14696960  
_________________________________________________________________
activation_107 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_54 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_38 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_108 (Activation)  (None, 3)                 0         
=================================================================
Total params: 14,708,643
Trainable params: 14,708,643
Non-trainable params: 0
_________________________________________________________________
