_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_49 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_73 (Activation)   (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_50 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_74 (Activation)   (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_25 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_37 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
conv2d_51 (Conv2D)           (None, 23, 39, 64)        18496     
_________________________________________________________________
activation_75 (Activation)   (None, 23, 39, 64)        0         
_________________________________________________________________
conv2d_52 (Conv2D)           (None, 21, 37, 64)        36928     
_________________________________________________________________
activation_76 (Activation)   (None, 21, 37, 64)        0         
_________________________________________________________________
max_pooling2d_26 (MaxPooling (None, 10, 18, 64)        0         
_________________________________________________________________
dropout_38 (Dropout)         (None, 10, 18, 64)        0         
_________________________________________________________________
flatten_13 (Flatten)         (None, 11520)             0         
_________________________________________________________________
dense_25 (Dense)             (None, 512)               5898752   
_________________________________________________________________
activation_77 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_39 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_26 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_78 (Activation)   (None, 3)                 0         
=================================================================
Total params: 5,965,859
Trainable params: 5,965,859
Non-trainable params: 0
_________________________________________________________________
