_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_71 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_109 (Activation)  (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_72 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_110 (Activation)  (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_36 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_55 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
flatten_20 (Flatten)         (None, 28704)             0         
_________________________________________________________________
dense_39 (Dense)             (None, 512)               14696960  
_________________________________________________________________
activation_111 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_56 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_40 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_112 (Activation)  (None, 3)                 0         
=================================================================
Total params: 14,708,643
Trainable params: 14,708,643
Non-trainable params: 0
_________________________________________________________________
