_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_93 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_153 (Activation)  (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_94 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_154 (Activation)  (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_47 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_77 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
flatten_31 (Flatten)         (None, 28704)             0         
_________________________________________________________________
dense_61 (Dense)             (None, 512)               14696960  
_________________________________________________________________
activation_155 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_78 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_62 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_156 (Activation)  (None, 3)                 0         
=================================================================
Total params: 14,708,643
Trainable params: 14,708,643
Non-trainable params: 0
_________________________________________________________________
