_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_85 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_137 (Activation)  (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_86 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_138 (Activation)  (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_43 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_69 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
flatten_27 (Flatten)         (None, 28704)             0         
_________________________________________________________________
dense_53 (Dense)             (None, 512)               14696960  
_________________________________________________________________
activation_139 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_70 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_54 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_140 (Activation)  (None, 3)                 0         
=================================================================
Total params: 14,708,643
Trainable params: 14,708,643
Non-trainable params: 0
_________________________________________________________________
