_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_57 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_85 (Activation)   (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_58 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_86 (Activation)   (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_29 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_43 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 23, 39, 64)        18496     
_________________________________________________________________
activation_87 (Activation)   (None, 23, 39, 64)        0         
_________________________________________________________________
conv2d_60 (Conv2D)           (None, 21, 37, 64)        36928     
_________________________________________________________________
activation_88 (Activation)   (None, 21, 37, 64)        0         
_________________________________________________________________
max_pooling2d_30 (MaxPooling (None, 10, 18, 64)        0         
_________________________________________________________________
dropout_44 (Dropout)         (None, 10, 18, 64)        0         
_________________________________________________________________
flatten_15 (Flatten)         (None, 11520)             0         
_________________________________________________________________
dense_29 (Dense)             (None, 512)               5898752   
_________________________________________________________________
activation_89 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_45 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_30 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_90 (Activation)   (None, 3)                 0         
=================================================================
Total params: 5,965,859
Trainable params: 5,965,859
Non-trainable params: 0
_________________________________________________________________
