_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_33 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_49 (Activation)   (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_50 (Activation)   (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_25 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 23, 39, 64)        18496     
_________________________________________________________________
activation_51 (Activation)   (None, 23, 39, 64)        0         
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 21, 37, 64)        36928     
_________________________________________________________________
activation_52 (Activation)   (None, 21, 37, 64)        0         
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 10, 18, 64)        0         
_________________________________________________________________
dropout_26 (Dropout)         (None, 10, 18, 64)        0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 11520)             0         
_________________________________________________________________
dense_17 (Dense)             (None, 512)               5898752   
_________________________________________________________________
activation_53 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_27 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_18 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_54 (Activation)   (None, 3)                 0         
=================================================================
Total params: 5,965,859
Trainable params: 5,965,859
Non-trainable params: 0
_________________________________________________________________
