_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_79 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_125 (Activation)  (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_80 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_126 (Activation)  (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_40 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_63 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
flatten_24 (Flatten)         (None, 28704)             0         
_________________________________________________________________
dense_47 (Dense)             (None, 512)               14696960  
_________________________________________________________________
activation_127 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_64 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_48 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_128 (Activation)  (None, 3)                 0         
=================================================================
Total params: 14,708,643
Trainable params: 14,708,643
Non-trainable params: 0
_________________________________________________________________
