_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_81 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_129 (Activation)  (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_82 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_130 (Activation)  (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_41 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_65 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
flatten_25 (Flatten)         (None, 28704)             0         
_________________________________________________________________
dense_49 (Dense)             (None, 512)               14696960  
_________________________________________________________________
activation_131 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_66 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_50 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_132 (Activation)  (None, 3)                 0         
=================================================================
Total params: 14,708,643
Trainable params: 14,708,643
Non-trainable params: 0
_________________________________________________________________
