_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_45 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_67 (Activation)   (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_46 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_68 (Activation)   (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_34 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 23, 39, 64)        18496     
_________________________________________________________________
activation_69 (Activation)   (None, 23, 39, 64)        0         
_________________________________________________________________
conv2d_48 (Conv2D)           (None, 21, 37, 64)        36928     
_________________________________________________________________
activation_70 (Activation)   (None, 21, 37, 64)        0         
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 10, 18, 64)        0         
_________________________________________________________________
dropout_35 (Dropout)         (None, 10, 18, 64)        0         
_________________________________________________________________
flatten_12 (Flatten)         (None, 11520)             0         
_________________________________________________________________
dense_23 (Dense)             (None, 512)               5898752   
_________________________________________________________________
activation_71 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_36 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_24 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_72 (Activation)   (None, 3)                 0         
=================================================================
Total params: 5,965,859
Trainable params: 5,965,859
Non-trainable params: 0
_________________________________________________________________
