_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_77 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_121 (Activation)  (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_78 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_122 (Activation)  (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_39 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_61 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
flatten_23 (Flatten)         (None, 28704)             0         
_________________________________________________________________
dense_45 (Dense)             (None, 512)               14696960  
_________________________________________________________________
activation_123 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_62 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_46 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_124 (Activation)  (None, 3)                 0         
=================================================================
Total params: 14,708,643
Trainable params: 14,708,643
Non-trainable params: 0
_________________________________________________________________
