_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_21 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_31 (Activation)   (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_32 (Activation)   (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_16 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 23, 39, 64)        18496     
_________________________________________________________________
activation_33 (Activation)   (None, 23, 39, 64)        0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 21, 37, 64)        36928     
_________________________________________________________________
activation_34 (Activation)   (None, 21, 37, 64)        0         
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 10, 18, 64)        0         
_________________________________________________________________
dropout_17 (Dropout)         (None, 10, 18, 64)        0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 11520)             0         
_________________________________________________________________
dense_11 (Dense)             (None, 512)               5898752   
_________________________________________________________________
activation_35 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_18 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_36 (Activation)   (None, 3)                 0         
=================================================================
Total params: 5,965,859
Trainable params: 5,965,859
Non-trainable params: 0
_________________________________________________________________
