_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_83 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_133 (Activation)  (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_84 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_134 (Activation)  (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_42 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_67 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
flatten_26 (Flatten)         (None, 28704)             0         
_________________________________________________________________
dense_51 (Dense)             (None, 512)               14696960  
_________________________________________________________________
activation_135 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_68 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_52 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_136 (Activation)  (None, 3)                 0         
=================================================================
Total params: 14,708,643
Trainable params: 14,708,643
Non-trainable params: 0
_________________________________________________________________
