_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_73 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_113 (Activation)  (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_74 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_114 (Activation)  (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_37 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_57 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
flatten_21 (Flatten)         (None, 28704)             0         
_________________________________________________________________
dense_41 (Dense)             (None, 512)               14696960  
_________________________________________________________________
activation_115 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_58 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_42 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_116 (Activation)  (None, 3)                 0         
=================================================================
Total params: 14,708,643
Trainable params: 14,708,643
Non-trainable params: 0
_________________________________________________________________
