_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_87 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_141 (Activation)  (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_88 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_142 (Activation)  (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_44 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_71 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
flatten_28 (Flatten)         (None, 28704)             0         
_________________________________________________________________
dense_55 (Dense)             (None, 512)               14696960  
_________________________________________________________________
activation_143 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_72 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_56 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_144 (Activation)  (None, 3)                 0         
=================================================================
Total params: 14,708,643
Trainable params: 14,708,643
Non-trainable params: 0
_________________________________________________________________
