_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_95 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_157 (Activation)  (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_96 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_158 (Activation)  (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_48 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_79 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
flatten_32 (Flatten)         (None, 28704)             0         
_________________________________________________________________
dense_63 (Dense)             (None, 512)               14696960  
_________________________________________________________________
activation_159 (Activation)  (None, 512)               0         
_________________________________________________________________
dropout_80 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_64 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_160 (Activation)  (None, 3)                 0         
=================================================================
Total params: 14,708,643
Trainable params: 14,708,643
Non-trainable params: 0
_________________________________________________________________
