_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_25 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_37 (Activation)   (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_38 (Activation)   (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_19 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 23, 39, 64)        18496     
_________________________________________________________________
activation_39 (Activation)   (None, 23, 39, 64)        0         
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 21, 37, 64)        36928     
_________________________________________________________________
activation_40 (Activation)   (None, 21, 37, 64)        0         
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 10, 18, 64)        0         
_________________________________________________________________
dropout_20 (Dropout)         (None, 10, 18, 64)        0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 11520)             0         
_________________________________________________________________
dense_13 (Dense)             (None, 512)               5898752   
_________________________________________________________________
activation_41 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_21 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_42 (Activation)   (None, 3)                 0         
=================================================================
Total params: 5,965,859
Trainable params: 5,965,859
Non-trainable params: 0
_________________________________________________________________
