_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 48, 80, 32)        896       
_________________________________________________________________
activation_7 (Activation)    (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_8 (Activation)    (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 23, 39, 32)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 23, 39, 64)        18496     
_________________________________________________________________
activation_9 (Activation)    (None, 23, 39, 64)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 21, 37, 64)        36928     
_________________________________________________________________
activation_10 (Activation)   (None, 21, 37, 64)        0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 10, 18, 64)        0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 10, 18, 64)        0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 11520)             0         
_________________________________________________________________
dense_3 (Dense)              (None, 512)               5898752   
_________________________________________________________________
activation_11 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 3)                 1539      
_________________________________________________________________
activation_12 (Activation)   (None, 3)                 0         
=================================================================
Total params: 5,965,859
Trainable params: 5,965,859
Non-trainable params: 0
_________________________________________________________________
