_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_17 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_25 (Activation)   (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_26 (Activation)   (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_13 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 23, 39, 64)        18496     
_________________________________________________________________
activation_27 (Activation)   (None, 23, 39, 64)        0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 21, 37, 64)        36928     
_________________________________________________________________
activation_28 (Activation)   (None, 21, 37, 64)        0         
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 10, 18, 64)        0         
_________________________________________________________________
dropout_14 (Dropout)         (None, 10, 18, 64)        0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 11520)             0         
_________________________________________________________________
dense_9 (Dense)              (None, 512)               5898752   
_________________________________________________________________
activation_29 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_15 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_30 (Activation)   (None, 3)                 0         
=================================================================
Total params: 5,965,859
Trainable params: 5,965,859
Non-trainable params: 0
_________________________________________________________________
