_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_41 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_61 (Activation)   (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_62 (Activation)   (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_31 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 23, 39, 64)        18496     
_________________________________________________________________
activation_63 (Activation)   (None, 23, 39, 64)        0         
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 21, 37, 64)        36928     
_________________________________________________________________
activation_64 (Activation)   (None, 21, 37, 64)        0         
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 10, 18, 64)        0         
_________________________________________________________________
dropout_32 (Dropout)         (None, 10, 18, 64)        0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 11520)             0         
_________________________________________________________________
dense_21 (Dense)             (None, 512)               5898752   
_________________________________________________________________
activation_65 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_33 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_22 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_66 (Activation)   (None, 3)                 0         
=================================================================
Total params: 5,965,859
Trainable params: 5,965,859
Non-trainable params: 0
_________________________________________________________________
