_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_65 (Conv2D)           (None, 48, 80, 32)        896       
_________________________________________________________________
activation_97 (Activation)   (None, 48, 80, 32)        0         
_________________________________________________________________
conv2d_66 (Conv2D)           (None, 46, 78, 32)        9248      
_________________________________________________________________
activation_98 (Activation)   (None, 46, 78, 32)        0         
_________________________________________________________________
max_pooling2d_33 (MaxPooling (None, 23, 39, 32)        0         
_________________________________________________________________
dropout_49 (Dropout)         (None, 23, 39, 32)        0         
_________________________________________________________________
flatten_17 (Flatten)         (None, 28704)             0         
_________________________________________________________________
dense_33 (Dense)             (None, 512)               14696960  
_________________________________________________________________
activation_99 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_50 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_34 (Dense)             (None, 3)                 1539      
_________________________________________________________________
activation_100 (Activation)  (None, 3)                 0         
=================================================================
Total params: 14,708,643
Trainable params: 14,708,643
Non-trainable params: 0
_________________________________________________________________
